cask_args appdir: '/Applications'

# Tap homebrew
tap 'homebrew/bundle'
tap 'homebrew/services'
#tap 'wallix/awless' # AWS command line tools


brew 'ack'
#brew 'ansible' # Ansible is a simple way to automate apps and IT infrastructure.
#brew 'automake' # Automake is a tool for automatically generating Makefile installation files.
#brew 'awless' # AWS command line tools
#brew 'awscli' # Amazon Web Services (AWS) Command Line Interface (CLI)
#brew 'bcrypt'
#brew 'bzip2', link: true # bzip
#brew 'chromedriver' # Selenium webdriver for Chrome browser
#brew 'cmake', link: true # Wireshark network monitoring, with the QT GUI.
#brew 'consul' # Consul tool for discovering and configuring services in your infrastructure
brew 'coreutils'
brew 'curl', link: true
#brew 'docker-compose' # Compose is a tool for defining and running multi-container Docker applications.
#brew 'docker' # Docker software cotainers to help distribute applications.
#brew 'doxygen' # Doxygen parses source code documenation annotations
#brew 'exif' ## Media-Related
#brew 'exiftags' ## Media-Related
#brew 'exiftool' ## Media-Related
brew 'ffmpeg' # FF MPEG for video
brew 'ffmpeg2theora' # FF MPEG for video
brew 'ffmpegthumbnailer' # FF MPEG for video
#brew 'flac' ## Media-Related
#brew 'fontconfig' # Fontconfig is a library for configuring and customizing font access.
#brew 'freetype' # FreeType is a freely available software library to render fonts.
#brew 'geckodriver' # Selenimum webdriver for Firefox browser
#brew 'geoip'
brew 'gh' # GitHub command-line tool
brew 'go' # Go programming language by Google; compare `C`.
brew 'goimports' # Go import tool
brew 'goreleaser' # Go release tool
brew 'golangci-lint' # Go linter for detecting bugs and enforcing code standards.
#brew 'google-app-engine'
#brew 'google-perftools'
#brew 'google-sparsehash'
#brew 'google-sql-tool'
brew 'gpg' # used for signing commits
#brew 'gradle' # Gradle is a Java build tool
#brew 'graphicsmagick' # GraphicsMagick is the swiss army knife of image processing.
#brew 'graphviz'
#brew 'grc'
#brew 'gzip' # GNU zip
#brew 'heroku' # Heroku app hosting
#brew 'howdoi' # howdoi shows instant coding answers via the command line
#brew 'html2text'
#brew 'htop'
#brew 'httperf'
brew 'imagemagick'
#brew 'jenv' # manage Java installations and environments
#brew 'jenkins' ## Continuous automation
#brew 'jmeter', args: ['with-plugins']
#brew 'jp2a'
#brew 'jq'
#brew 'kubectl' # Kubernetes command-line tool to run commands against Kubernetes clusters.
#brew 'lcdf-typetools' # Command-line programs for manipulating fonts
#brew 'libcaca', args: ['with-imlib2']
#brew 'libgit2'
#brew 'libzip' # ZIP file compression
#brew 'maven' # Maven is a Java build tool
#brew 'minikube' # Run a single-node Kubernetes cluster in a virtual machine on your personal computer.
#brew 'monit' # Monit is for managing and monitoring Unix systems.
#brew 'mtr' # mtr: a better tool for ping and traceroute
brew 'n'
#brew 'nagios' # Nagios IT infrastructure monitoring.
#brew 'netcat' # Netcat is a networking utility for the TCP/IP protocol.
#brew 'nmap' # nmap network mapper is a security scanner
brew 'openssl' # OpenSSL is an open-source implementation of the SSL and TLS protocols.
#brew 'p7zip'
brew 'pandoc' # Pandoc converts among various formats, such as Markdown and HTML
#brew 'pkg-config', link: true # Tmux is a newer terminal multiplexer.
brew 'pinentry-mac' # Pinentry is a small collection of scripts which make gpg, pass, ssh, git etc. work with the pinentry program.
#brew 'plantuml' # PlantUML markup text to diagram
#brew 'prettyping' # prettyping: ping with colorful output and progress bars
#brew 'protobuf-c' # Protocol buffers for serializing structured data; compare thrift.
#brew 'protobuf' # Protocol buffers for serializing structured data; compare thrift.
#brew 'pssh' # Parallel SSH
#brew 'readline'
#brew 'reattach-to-user-namespace'
#brew 'roundup'
brew 'rsync'
#brew 'selenium-server-standalone' # Selenium standalone server
#brew 'siege' # Siege is an http load testing and benchmarking utility.
#brew 'spaceman-diff'
#brew 'spark'
#brew 'stripe/stripe-cli/stripe'
#brew 'stripe/stripe-mock/stripe-mock'
#brew 'terraform' # Terraform common configuration to launch infrastructure.
#brew 'theora' # FF MPEG for video
#brew 'thrift' # Thrift network serialization protocol; compare protobuf.
#brew 'tldr' # TLDR provides simplified and community-driven man pages
#brew 'tmux' # Tmux is a newer terminal multiplexer.
brew 'unar' # Decompression for RAR and ZIP files.
brew 'unzip' # unzip is the classic command.
brew 'unison' # Unison file synchronizer.
#brew 'vtk' # Visualization Toolkit for manipulating and displaying scientific data
brew 'wget'
brew 'yarn'
brew 'yt-dlp'
brew 'zsh' # Zsh is a shell designed for interactive use.
brew 'zstd' # Zstandard is the best modern compression

cask '1password' ###  Applications
#cask 'adoptopenjdk8' #Java 8
#cask 'alfred'
#cask 'android-file-transfer'###  Applications
#cask 'android-messages'
#cask 'android-ndk'
#cask 'android-platform-tools'
#cask 'android-sdk'
#cask 'android-studio'
#cask 'anki'
cask 'appcleaner' ###  Applications
#cask 'arq'
#cask 'atext'
#cask 'backblaze-downloader'
#cask 'backuploupe'
#cask 'balsamiq-mockups'
#cask 'bartender'
#cask 'beacon-scanner'
#cask 'blender' # Blender 3D modeller
#cask 'brain-workshop'
#cask 'caffeine'
#cask 'calibre'
#cask 'charles' # Charles: enables a developer to view HTTP traffic.
cask 'chatgpt'
#cask 'cheatsheet'
#cask 'coconutbattery'
#cask 'codekit'
#cask 'commandq'
#cask 'dash' # Dash documentation browser and code snippet manager
cask 'diffusionbee'
cask 'docker' # Docker assembles applications from components.
cask 'dropbox'
#cask 'duet'
cask 'figma'
#cask 'fluid'
#cask 'flutter'### Development SDK
cask 'font-roboto-mono-for-powerline'# FONTS
cask 'font-roboto-mono'# FONTS
cask 'font-roboto-slab'# FONTS
cask 'font-roboto'# FONTS
cask 'fontbase'
#cask 'freemind' # Freemind mind map editor
#cask 'freeplane'
#cask 'ganttproject'
#cask 'gfxcardstatus'
#cask 'gimp' # Gimp pixel-based image editor, similar to Adobe Photoshop
#cask 'gitx'
cask 'google-chrome' ###  Applications
cask 'handbrake' ###  Applications
#cask 'harvest'
#cask 'hockey'
#cask 'imageoptim' # Image optimizer
#cask 'inkscape' # Inkscape vector-based image editor, similar to Adobe Illustrator
cask 'iterm2' # iTerm is our favorite terminal app.
#cask 'joinme'
#cask 'jumpcut'
#cask 'keybase' ###  Applications
#cask 'krita'
#cask 'kube-solo' # Kubernetes Solo cluster for macOS.
#cask 'launchy'
#cask 'little-snitch'
#cask 'macdown' # MacDown simple markdown editor
#cask 'mark-text' # MarkText free open source markdown editor
cask 'microsoft-office'
#cask 'paparazzi'
#cask 'postman' # Postman: a complete API Development Environment.
cask 'proton-mail' # Proton Mail email client
#cask 'pupil'
cask 'qlcolorcode' ### Quick Look plugins https://github.com/sindresorhus/quick-look-plugins
cask 'qlmarkdown'### Quick Look plugins https://github.com/sindresorhus/quick-look-plugins
cask 'qlstephen'### Quick Look plugins https://github.com/sindresorhus/quick-look-plugins
cask 'qlvideo'### Quick Look plugins https://github.com/sindresorhus/quick-look-plugins
cask 'quicklook-json'### Quick Look plugins https://github.com/sindresorhus/quick-look-plugins
cask 'quicklookase'### Quick Look plugins https://github.com/sindresorhus/quick-look-plugins
cask 'raycast'
#cask 'rescuetime'
#cask 'sequential'
#cask 'shortcat'
#cask 'shotcut' # Shotcut movie editor
#cask 'skitch'
#cask 'slack' # Slack chat client
#cask 'sleep-monitor'
#cask 'superduper'
#cask 'suspicious-package'### Quick Look plugins https://github.com/sindresorhus/quick-look-plugins
#cask 'synergy' # Synergy screen sharing utility
#cask 'teamviewer'###  Applications
cask 'telegram'
#cask 'thisservice'
#cask 'transmit'
#cask 'unison' # Unison file synchronizer.
#cask 'visual-studio-code'###  Applications
cask 'cursor' # Cursor IDE
cask 'vlc'###  Applications
#cask 'wireshark-chmodbpf' # Wireshark-chmodbft enables regular users to capture network packets.
#cask 'yed' # yEd is desktop application to generate high-quality diagrams
