cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
#brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'n'
brew 'openssl'
brew 'readline'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
#brew 'jmeter', args: ['with-plugins']
#brew 'terraform'
brew 'unrar'

# Quick Look plugins https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

#Android Development
cask android-studio

#Development SDK
cask flutter

# Applications
cask 'android-file-transfer'
cask 'dropbox'
cask 'google-chrome'
cask '1password'
cask 'handbrake'
cask 'teamviewer'
cask 'visual-studio-code'
cask 'vlc'

# Try out Applications
cask 'appcleaner'
#cask 'cheatsheet'
#cask 'caffeine'
#cask 'spectacle'
#cask 'transmission'
