cask_args appdir: '/Applications'

# Tap homebrew
tap 'homebrew/bundle'
tap 'homebrew/services'
#tap 'wallix/awless' # AWS command line tools


brew 'ack' # Text search tool similar to grep.
#brew 'ansible' # Automates apps and IT infrastructure.
#brew 'automake' # Automake is a tool for automatically generating Makefile installation files.
#brew 'awless' # AWS command line tools.
#brew 'awscli' # Amazon Web Services (AWS) CLI.
#brew 'bcrypt' # Password hashing library and tools.
#brew 'bzip2', link: true # bzip compression utilities.
#brew 'chromedriver' # Selenium WebDriver for Chrome.
#brew 'cmake', link: true # Cross-platform build system generator.
#brew 'consul' # Service discovery and configuration tool.
brew 'coreutils' # GNU core utilities.
brew 'curl', link: true # Command-line HTTP client.
#brew 'docker-compose' # Define and run multi-container Docker apps.
#brew 'docker' # Container runtime and tooling.
#brew 'doxygen' # Documentation generator from source.
#brew 'exif' # Media-related EXIF metadata tools.
#brew 'exiftags' # Media-related EXIF tag reader.
#brew 'exiftool' # Media-related EXIF metadata editor.
brew 'ffmpeg' # FF MPEG for video
brew 'ffmpeg2theora' # FF MPEG for video
brew 'ffmpegthumbnailer' # FF MPEG for video
#brew 'flac' # Lossless audio codec and tools.
#brew 'fontconfig' # Configure and customize font access.
#brew 'freetype' # Font rendering library.
#brew 'geckodriver' # Selenium WebDriver for Firefox.
#brew 'geoip' # IP geolocation lookup library/tools.
brew 'gh' # GitHub command-line tool
brew 'go' # Go programming language by Google; compare `C`.
brew 'goimports' # Go import tool
brew 'goreleaser' # Go release tool
brew 'golangci-lint' # Go linter for detecting bugs and enforcing code standards.
#brew 'google-app-engine' # App Engine SDK tools.
#brew 'google-perftools' # Performance analysis tools.
#brew 'google-sparsehash' # Sparse hash map implementations.
#brew 'google-sql-tool' # Google SQL query tool.
brew 'gpg' # used for signing commits
#brew 'gradle' # Gradle is a Java build tool
#brew 'graphicsmagick' # GraphicsMagick is the swiss army knife of image processing.
#brew 'graphviz' # Graph visualization toolkit.
#brew 'grc' # Colorize command output.
#brew 'gzip' # GNU gzip compression tools.
#brew 'heroku' # Heroku CLI for app hosting.
#brew 'howdoi' # Instant coding answers in the terminal.
#brew 'html2text' # Convert HTML to plain text.
#brew 'htop' # Interactive process viewer.
#brew 'httperf' # HTTP load testing tool.
brew 'imagemagick' # Image manipulation tools.
#brew 'jenv' # Manage Java versions and environments.
#brew 'jenkins' # Continuous integration server.
#brew 'jmeter', args: ['with-plugins'] # Load testing tool with plugins.
#brew 'jp2a' # Convert images to ASCII art.
#brew 'jq' # Command-line JSON processor.
#brew 'kubectl' # Kubernetes command-line tool to run commands against Kubernetes clusters.
#brew 'lcdf-typetools' # Command-line programs for manipulating fonts
#brew 'libcaca', args: ['with-imlib2'] # ASCII art graphics library.
#brew 'libgit2' # Git core library.
#brew 'libzip' # ZIP file compression
#brew 'maven' # Maven is a Java build tool
#brew 'minikube' # Local single-node Kubernetes.
#brew 'monit' # System monitoring and process management.
#brew 'mtr' # Ping/traceroute network diagnostic tool.
brew 'n' # Node.js version manager.
#brew 'nagios' # IT infrastructure monitoring.
#brew 'netcat' # TCP/IP networking utility.
#brew 'nmap' # Network scanner and mapper.
brew 'openssl' # OpenSSL is an open-source implementation of the SSL and TLS protocols.
#brew 'p7zip' # 7-Zip file archiver.
brew 'pandoc' # Pandoc converts among various formats, such as Markdown and HTML
#brew 'pkg-config', link: true # Metadata for compiler/linker flags.
brew 'pinentry-mac' # Pinentry is a small collection of scripts which make gpg, pass, ssh, git etc. work with the pinentry program.
#brew 'plantuml' # Generate diagrams from text.
#brew 'prettyping' # Ping with colorful output and progress bars.
#brew 'protobuf-c' # Protocol buffers for serializing structured data; compare thrift.
#brew 'protobuf' # Protocol buffers for serializing structured data; compare thrift.
#brew 'pssh' # Parallel SSH client.
#brew 'readline' # Readline library for line editing.
#brew 'reattach-to-user-namespace' # Reattach stdin/stdout in tmux.
#brew 'roundup' # Bash unit testing framework.
brew 'rsync' # File synchronization utility.
#brew 'selenium-server-standalone' # Selenium standalone server
#brew 'siege' # Siege is an http load testing and benchmarking utility.
#brew 'spaceman-diff' # Diff tool for git branches.
#brew 'spark' # Sparklines in the terminal.
#brew 'stripe/stripe-cli/stripe' # Stripe CLI for API tooling.
#brew 'stripe/stripe-mock/stripe-mock' # Mock Stripe API server.
#brew 'terraform' # Terraform common configuration to launch infrastructure.
#brew 'theora' # FF MPEG for video
#brew 'thrift' # Thrift network serialization protocol; compare protobuf.
#brew 'tldr' # Simplified community-driven man pages.
#brew 'tmux' # Terminal multiplexer.
brew 'unar' # Decompression for RAR and ZIP files.
brew 'unzip' # unzip is the classic command.
brew 'unison' # Unison file synchronizer.
#brew 'vtk' # Visualization Toolkit for scientific data.
brew 'wget' # Command-line file downloader.
brew 'yarn' # JavaScript package manager.
brew 'yt-dlp' # Video downloader for many sites.
brew 'zsh' # Zsh is a shell designed for interactive use.
brew 'zstd' # Zstandard is the best modern compression

cask '1password' ### Applications - Password manager.
#cask 'adoptopenjdk8' # Java 8 distribution.
#cask 'alfred' # Launcher and productivity app.
#cask 'android-file-transfer' ### Applications - Transfer files to Android.
#cask 'android-messages' # Android Messages desktop app.
#cask 'android-ndk' # Android Native Development Kit.
#cask 'android-platform-tools' # Android SDK platform tools.
#cask 'android-sdk' # Android SDK.
#cask 'android-studio' # Android IDE.
#cask 'anki' # Flashcard spaced-repetition app.
cask 'appcleaner' ### Applications - App uninstaller with leftovers cleanup.
#cask 'arq' # Backup client.
#cask 'atext' # Text expansion tool.
#cask 'backblaze-downloader' # Backblaze download client.
#cask 'backuploupe' # Backup status monitor.
#cask 'balsamiq-mockups' # Wireframing tool.
#cask 'bartender' # Menu bar organizer.
#cask 'beacon-scanner' # Bluetooth beacon scanner.
#cask 'blender' # Blender 3D modeller
#cask 'brain-workshop' # Brain training app.
#cask 'caffeine' # Prevents sleep, keeps Mac awake.
#cask 'calibre' # E-book management tool.
#cask 'charles' # Charles: enables a developer to view HTTP traffic.
cask 'chatgpt' # ChatGPT desktop app.
#cask 'cheatsheet' # Shortcut key overlay.
#cask 'coconutbattery' # Battery health monitor.
#cask 'codekit' # Front-end build tools.
#cask 'commandq' # Hide/quit apps with a shortcut.
#cask 'dash' # Dash documentation browser and code snippet manager
cask 'diffusionbee' # Local Stable Diffusion app.
cask 'docker' # Docker assembles applications from components.
cask 'dropbox' # Cloud file sync and sharing.
#cask 'duet' # Use iPad as a second display.
cask 'figma' # Collaborative design and prototyping tool.
#cask 'fluid' # Turn websites into desktop apps.
#cask 'flutter' ### Development SDK - Flutter UI toolkit.
cask 'font-roboto-mono-for-powerline' # FONTS - Roboto Mono Powerline font.
cask 'font-roboto-mono' # FONTS - Roboto Mono font family.
cask 'font-roboto-slab' # FONTS - Roboto Slab font family.
cask 'font-roboto' # FONTS - Roboto font family.
cask 'fontbase' # Font manager.
#cask 'freemind' # Freemind mind map editor
#cask 'freeplane' # Mind-mapping tool.
#cask 'ganttproject' # Gantt chart project planner.
#cask 'gfxcardstatus' # GPU switching control.
#cask 'gimp' # Gimp pixel-based image editor, similar to Adobe Photoshop
#cask 'gitx' # Git GUI client.
cask 'google-chrome' ### Applications - Web browser.
cask 'handbrake' ### Applications - Video transcoder.
#cask 'harvest' # Time tracking app.
#cask 'hockey' # App distribution and crash reporting.
#cask 'imageoptim' # Image optimizer
#cask 'inkscape' # Inkscape vector-based image editor, similar to Adobe Illustrator
cask 'iterm2' # iTerm is our favorite terminal app.
#cask 'joinme' # Remote access and meetings.
#cask 'jumpcut' # Clipboard manager.
#cask 'keybase' ### Applications - Encrypted chat and file sharing.
#cask 'krita' # Digital painting app.
#cask 'kube-solo' # Kubernetes Solo cluster for macOS.
#cask 'launchy' # Application launcher.
#cask 'little-snitch' # Outbound network firewall.
#cask 'macdown' # MacDown simple markdown editor
#cask 'mark-text' # MarkText free open source markdown editor
cask 'microsoft-office' # Office productivity suite.
#cask 'paparazzi' # App screenshot tool.
#cask 'postman' # API development environment.
cask 'proton-mail' # Proton Mail email client
#cask 'pupil' # Eye tracking platform.
cask 'qbittorrent' # BitTorrent client
cask 'qlcolorcode' ### Quick Look plugins - Colorize source code https://github.com/sindresorhus/quick-look-plugins
cask 'qlmarkdown' ### Quick Look plugins - Render Markdown https://github.com/sindresorhus/quick-look-plugins
cask 'qlstephen' ### Quick Look plugins - Preview plain text https://github.com/sindresorhus/quick-look-plugins
cask 'qlvideo' ### Quick Look plugins - Preview videos https://github.com/sindresorhus/quick-look-plugins
cask 'quicklook-json' ### Quick Look plugins - Preview JSON https://github.com/sindresorhus/quick-look-plugins
cask 'quicklookase' ### Quick Look plugins - Preview ASE files https://github.com/sindresorhus/quick-look-plugins
cask 'raycast' # Launcher and productivity tools.
#cask 'rescuetime' # Time tracking and focus analytics.
#cask 'sequential' # Comic reader.
#cask 'shortcat' # Keyboard navigation helper.
#cask 'shotcut' # Shotcut movie editor
#cask 'skitch' # Screenshot and annotation tool.
#cask 'slack' # Team chat client.
#cask 'sleep-monitor' # Sleep tracking app.
#cask 'superduper' # Disk cloning and backups.
#cask 'suspicious-package' ### Quick Look plugins - Inspect installer packages https://github.com/sindresorhus/quick-look-plugins
#cask 'synergy' # Synergy screen sharing utility
#cask 'teamviewer' ### Applications - Remote access tool.
cask 'telegram' # Messaging app.
#cask 'thisservice' # Services menu helper.
#cask 'transmit' # FTP/SFTP client.
#cask 'unison' # Unison file synchronizer.
#cask 'visual-studio-code' ### Applications - Code editor.
cask 'cursor' # Cursor IDE
cask 'vlc' ### Applications - Media player.
#cask 'wireshark-chmodbpf' # Wireshark-chmodbft enables regular users to capture network packets.
#cask 'yed' # yEd is desktop application to generate high-quality diagrams
